{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "__author__ = 'Алексей Сидорюк'\n",
    "\n",
    "# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.\n",
    "# Например, дается x = 58375.\n",
    "# Нужно вывести максимальную цифру в данном числе, т.е. 8.\n",
    "# Подразумевается, что мы не знаем это число заранее.\n",
    "# Число приходит в виде целого беззнакового.\n",
    "# Подсказки:\n",
    "# * постарайтесь решить задачу с применением арифметики и цикла while;\n",
    "# * при желании и понимании решите задачу с применением цикла for.\n",
    "\n",
    "number_str = input('Введите целое число: ')\n",
    "max_num = 0\n",
    "\n",
    "if int(number_str) < 0:\n",
    "    number_str = number_str[1:]\n",
    "\n",
    "for i in number_str:\n",
    "    if int(i) > max_num:\n",
    "        max_num = int(i)\n",
    "print('максимальная цифра в числе ', number_str, ' - ', max_num, '\\n')\n",
    "\n",
    "\n",
    "# Задача-2: Исходные значения двух переменных запросить у пользователя.\n",
    "# Поменять значения переменных местами. Вывести новые значения на экран.\n",
    "# Решите задачу, используя только две переменные.\n",
    "# Подсказки:\n",
    "# * постарайтесь сделать решение через действия над числами;\n",
    "# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.\n",
    "\n",
    "# 1.\n",
    "print('Меняем переменные местами.', '\\n')\n",
    "T = (input('Введите a: '), input('Введите b: '))\n",
    "a = T[1]\n",
    "b = T[0]\n",
    "print ('a = ', a, ' b = ', b, '\\n')\n",
    "\n",
    "#2.\n",
    "print('Меняем переменные местами.', '\\n')\n",
    "a = input('Введите a: ')\n",
    "b = input('Введите b: ')\n",
    "a = a + b\n",
    "b = b + a\n",
    "a = a[(2*len(a) - len(b)):len(a)]\n",
    "print('a = ', a)\n",
    "b = b[len(a):(len(b) - len(a))]\n",
    "print('b = ', b, '\\n')\n",
    "\n",
    "\n",
    "# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида\n",
    "# ax² + bx + c = 0.\n",
    "# Коэффициенты уравнения вводятся пользователем.\n",
    "# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:\n",
    "# import math\n",
    "# math.sqrt(4) - вычисляет корень числа 4\n",
    "\n",
    "import math\n",
    "\n",
    "print('Введите коэффициенты квадратного трехчлена ax**2 + bx + c = 0:')\n",
    "T = (input('Введите a: '), input('Введите b: '), input('Введите c: '))\n",
    "\n",
    "D = int(T[1])**2 - 4*int(T[0])*int(T[2])\n",
    "\n",
    "if int(T[0]) != 0:\n",
    "    if D < 0:\n",
    "        print(T[0],'x**2 + ', T[1], 'x + ', T[2], ' = 0. Его корни: ', end=' ')\n",
    "        print('x1 = ', (-1)*int(T[1])/(2*int(T[0])), '+', math.sqrt((-1)*D)/(2*int(T[0])), 'i', ';', end=' ')\n",
    "        print('x2 = ', (-1)*int(T[1])/(2*int(T[0])), '-', math.sqrt((-1)*D)/(2*int(T[0])), 'i', end=' ')\n",
    "    else:\n",
    "        print(T[0],'x**2 + ', T[1], 'x + ', T[2], ' = 0. Его корни: ', end=' ')\n",
    "        print('x1 = ', ((-1)*int(T[1]) + math.sqrt(D))/(2*int(T[0])), ';', end=' ')\n",
    "        print('x2 = ', ((-1)*int(T[1]) - math.sqrt(D))/(2*int(T[0])), end=' ')\n",
    "else:\n",
    "    print('a не должен быть = 0')\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
